---
kind: type
id: T:Autodesk.Revit.DB.CurvedEdgeConditionParam
source: html/e37cd05c-8373-55b8-dd1f-e1df492ad4be.htm
---
# Autodesk.Revit.DB.CurvedEdgeConditionParam

The allowed values for the HOST_SSE_CURVED_EDGE_CONDITION_PARAM parameter.

## Syntax (C#)
```csharp
public enum CurvedEdgeConditionParam
```